#### DuctPressureDropData Members

---

|  |
| --- |
| DuctPressureDropData Class   Methods   Properties   See Also |

The  DuctPressureDropData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DuctPressureDropData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CategoryId | The category id of duct curves. It will be OST\_DuctCurves, OST\_FlexDuctCurves, or OST\_PlaceHolderDucts. |
| Public property | Coefficient | The coefficient of the duct. |
| Public property | Density | The density of the duct.Units: (kg/ftÂ³). |
| Public property | EquivalentDiameter | The equivalent diameter of the duct. Units: (ft). |
| Public property | Flow | The flow of the duct. Units: (ftÂ³/s). |
| Public property | Friction | The friction of the duct. Units: (kg/(ftÂ²Â·sÂ²)). |
| Public property | Height | The height of the duct. If the duct is round, it will be equal to the diameter of the duct. Units: (ft). |
| Public property | HydraulicDiameter | The hydraulic diameter of the duct. Units: (ft). |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Length | The length of the duct. Units: (ft). |
| Public property | Level | The calculation level of the system. |
| Public property | PressureDrop | The pressure drop of the duct. Units: (kg/(ftÂ·sÂ²)). |
| Public property | ReynoldsNumber | The reynolds number of the duct. |
| Public property | Roughness | The roughness of the duct. Units: (ft). |
| Public property | Shape | The profile type of the duct. |
| Public property | Velocity | The velocity of the duct. Units: (ft/s). |
| Public property | VelocityPressure | The velocity pressure of the duct. Units: (kg/(ftÂ·sÂ²)). |
| Public property | Viscosity | The viscosity of the duct. Units: (kg/(ftÂ·s)). |
| Public property | WidthOrDiameter | The diameter of the duct with round profile, or the width of the duct with other profiles. Units: (ft). |

# See Also

DuctPressureDropData Class

Autodesk.Revit.DB.Mechanical Namespace